In [21]:
df = pd.read_csv('./nyc_hs_sat.csv', index_col = 0)

In [22]:
df.head()

,dbn,name,num_test_takers,reading_avg,math_avg,writing_score,boro,total_students,graduation_rate,attendance_rate,college_career_rate
0,01M292,HENRY STREET SCHOOL FOR INTERNATIONAL STUDIES,29.0,355.0,404.0,363.0,M,171,0.66,0.87,0.36
1,01M448,UNIVERSITY NEIGHBORHOOD HIGH SCHOOL,91.0,383.0,423.0,366.0,M,465,0.90,0.93,0.70
2,01M450,EAST SIDE COMMUNITY SCHOOL,70.0,377.0,402.0,370.0,M,683,0.92,0.94,0.77
3,01M509,MARTA VALLE HIGH SCHOOL,44.0,390.0,433.0,384.0,M,148,0.74,0.79,0.49
4,01M539,"NEW EXPLORATIONS INTO SCIENCE, TECHNOLOGY AND ...",159.0,522.0,574.0,525.0,M,1734,0.97,0.95,0.85

In [30]:
reading_avg = df['reading_avg'].map(str)

In [31]:
df['reading_avg'] = reading_avg

In [33]:
math_avg = df.math_avg.map(str)

In [35]:
df['math_avg'] = math_avg

In [37]:
writing_score = df['writing_score'].map(str)

In [38]:
df['writing_score'] = writing_score

In [39]:
df.dtypes

dbn                     object
name                    object
num_test_takers        float64
reading_avg             object
math_avg                object
writing_score           object
boro                    object
total_students           int64
graduation_rate        float64
attendance_rate        float64
college_career_rate    float64
dtype: object